RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/pdm_reg.h
/**
  ******************************************************************************
  * @file    pdm_reg.h
  * @version V1.0
  * @date    2021-07-19
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __PDM_REG_H__
#define __PDM_REG_H__

#include "bl808.h"

/* 0xC00 : audpdm_top */
#define PDM_AUDPDM_TOP_OFFSET    (0xC00)
#define PDM_AUDIO_CKG_EN         PDM_AUDIO_CKG_EN
#define PDM_AUDIO_CKG_EN_POS     (0U)
#define PDM_AUDIO_CKG_EN_LEN     (1U)
#define PDM_AUDIO_CKG_EN_MSK     (((1U << PDM_AUDIO_CKG_EN_LEN) - 1) << PDM_AUDIO_CKG_EN_POS)
#define PDM_AUDIO_CKG_EN_UMSK    (~(((1U << PDM_AUDIO_CKG_EN_LEN) - 1) << PDM_AUDIO_CKG_EN_POS))
#define PDM_ADC_ITF_INV_SEL      PDM_ADC_ITF_INV_SEL
#define PDM_ADC_ITF_INV_SEL_POS  (2U)
#define PDM_ADC_ITF_INV_SEL_LEN  (1U)
#define PDM_ADC_ITF_INV_SEL_MSK  (((1U << PDM_ADC_ITF_INV_SEL_LEN) - 1) << PDM_ADC_ITF_INV_SEL_POS)
#define PDM_ADC_ITF_INV_SEL_UMSK (~(((1U << PDM_ADC_ITF_INV_SEL_LEN) - 1) << PDM_ADC_ITF_INV_SEL_POS))
#define PDM_ITF_INV_SEL          PDM_ITF_INV_SEL
#define PDM_ITF_INV_SEL_POS      (3U)
#define PDM_ITF_INV_SEL_LEN      (1U)
#define PDM_ITF_INV_SEL_MSK      (((1U << PDM_ITF_INV_SEL_LEN) - 1) << PDM_ITF_INV_SEL_POS)
#define PDM_ITF_INV_SEL_UMSK     (~(((1U << PDM_ITF_INV_SEL_LEN) - 1) << PDM_ITF_INV_SEL_POS))
#define PDM_ADC_RATE             PDM_ADC_RATE
#define PDM_ADC_RATE_POS         (28U)
#define PDM_ADC_RATE_LEN         (3U)
#define PDM_ADC_RATE_MSK         (((1U << PDM_ADC_RATE_LEN) - 1) << PDM_ADC_RATE_POS)
#define PDM_ADC_RATE_UMSK        (~(((1U << PDM_ADC_RATE_LEN) - 1) << PDM_ADC_RATE_POS))

/* 0xC04 : audpdm_itf */
#define PDM_AUDPDM_ITF_OFFSET (0xC04)
#define PDM_ADC_0_EN          PDM_ADC_0_EN
#define PDM_ADC_0_EN_POS      (0U)
#define PDM_ADC_0_EN_LEN      (1U)
#define PDM_ADC_0_EN_MSK      (((1U << PDM_ADC_0_EN_LEN) - 1) << PDM_ADC_0_EN_POS)
#define PDM_ADC_0_EN_UMSK     (~(((1U << PDM_ADC_0_EN_LEN) - 1) << PDM_ADC_0_EN_POS))
#define PDM_ADC_1_EN          PDM_ADC_1_EN
#define PDM_ADC_1_EN_POS      (1U)
#define PDM_ADC_1_EN_LEN      (1U)
#define PDM_ADC_1_EN_MSK      (((1U << PDM_ADC_1_EN_LEN) - 1) << PDM_ADC_1_EN_POS)
#define PDM_ADC_1_EN_UMSK     (~(((1U << PDM_ADC_1_EN_LEN) - 1) << PDM_ADC_1_EN_POS))
#define PDM_ADC_2_EN          PDM_ADC_2_EN
#define PDM_ADC_2_EN_POS      (2U)
#define PDM_ADC_2_EN_LEN      (1U)
#define PDM_ADC_2_EN_MSK      (((1U << PDM_ADC_2_EN_LEN) - 1) << PDM_ADC_2_EN_POS)
#define PDM_ADC_2_EN_UMSK     (~(((1U << PDM_ADC_2_EN_LEN) - 1) << PDM_ADC_2_EN_POS))
#define PDM_AUD_RX0_SEL       PDM_AUD_RX0_SEL
#define PDM_AUD_RX0_SEL_POS   (13U)
#define PDM_AUD_RX0_SEL_LEN   (3U)
#define PDM_AUD_RX0_SEL_MSK   (((1U << PDM_AUD_RX0_SEL_LEN) - 1) << PDM_AUD_RX0_SEL_POS)
#define PDM_AUD_RX0_SEL_UMSK  (~(((1U << PDM_AUD_RX0_SEL_LEN) - 1) << PDM_AUD_RX0_SEL_POS))
#define PDM_AUD_RX1_SEL       PDM_AUD_RX1_SEL
#define PDM_AUD_RX1_SEL_POS   (16U)
#define PDM_AUD_RX1_SEL_LEN   (3U)
#define PDM_AUD_RX1_SEL_MSK   (((1U << PDM_AUD_RX1_SEL_LEN) - 1) << PDM_AUD_RX1_SEL_POS)
#define PDM_AUD_RX1_SEL_UMSK  (~(((1U << PDM_AUD_RX1_SEL_LEN) - 1) << PDM_AUD_RX1_SEL_POS))
#define PDM_AUD_RX2_SEL       PDM_AUD_RX2_SEL
#define PDM_AUD_RX2_SEL_POS   (19U)
#define PDM_AUD_RX2_SEL_LEN   (3U)
#define PDM_AUD_RX2_SEL_MSK   (((1U << PDM_AUD_RX2_SEL_LEN) - 1) << PDM_AUD_RX2_SEL_POS)
#define PDM_AUD_RX2_SEL_UMSK  (~(((1U << PDM_AUD_RX2_SEL_LEN) - 1) << PDM_AUD_RX2_SEL_POS))
#define PDM_ADC_ITF_EN        PDM_ADC_ITF_EN
#define PDM_ADC_ITF_EN_POS    (30U)
#define PDM_ADC_ITF_EN_LEN    (1U)
#define PDM_ADC_ITF_EN_MSK    (((1U << PDM_ADC_ITF_EN_LEN) - 1) << PDM_ADC_ITF_EN_POS)
#define PDM_ADC_ITF_EN_UMSK   (~(((1U << PDM_ADC_ITF_EN_LEN) - 1) << PDM_ADC_ITF_EN_POS))

/* 0xC08 : pdm_adc_0 */
#define PDM_ADC_0_OFFSET        (0xC08)
#define PDM_ADC_0_FIR_MODE      PDM_ADC_0_FIR_MODE
#define PDM_ADC_0_FIR_MODE_POS  (0U)
#define PDM_ADC_0_FIR_MODE_LEN  (1U)
#define PDM_ADC_0_FIR_MODE_MSK  (((1U << PDM_ADC_0_FIR_MODE_LEN) - 1) << PDM_ADC_0_FIR_MODE_POS)
#define PDM_ADC_0_FIR_MODE_UMSK (~(((1U << PDM_ADC_0_FIR_MODE_LEN) - 1) << PDM_ADC_0_FIR_MODE_POS))
#define PDM_ADC_1_FIR_MODE      PDM_ADC_1_FIR_MODE
#define PDM_ADC_1_FIR_MODE_POS  (1U)
#define PDM_ADC_1_FIR_MODE_LEN  (1U)
#define PDM_ADC_1_FIR_MODE_MSK  (((1U << PDM_ADC_1_FIR_MODE_LEN) - 1) << PDM_ADC_1_FIR_MODE_POS)
#define PDM_ADC_1_FIR_MODE_UMSK (~(((1U << PDM_ADC_1_FIR_MODE_LEN) - 1) << PDM_ADC_1_FIR_MODE_POS))
#define PDM_ADC_2_FIR_MODE      PDM_ADC_2_FIR_MODE
#define PDM_ADC_2_FIR_MODE_POS  (2U)
#define PDM_ADC_2_FIR_MODE_LEN  (1U)
#define PDM_ADC_2_FIR_MODE_MSK  (((1U << PDM_ADC_2_FIR_MODE_LEN) - 1) << PDM_ADC_2_FIR_MODE_POS)
#define PDM_ADC_2_FIR_MODE_UMSK (~(((1U << PDM_ADC_2_FIR_MODE_LEN) - 1) << PDM_ADC_2_FIR_MODE_POS))
#define PDM_ADC_0_SCAL          PDM_ADC_0_SCAL
#define PDM_ADC_0_SCAL_POS      (3U)
#define PDM_ADC_0_SCAL_LEN      (6U)
#define PDM_ADC_0_SCAL_MSK      (((1U << PDM_ADC_0_SCAL_LEN) - 1) << PDM_ADC_0_SCAL_POS)
#define PDM_ADC_0_SCAL_UMSK     (~(((1U << PDM_ADC_0_SCAL_LEN) - 1) << PDM_ADC_0_SCAL_POS))
#define PDM_ADC_1_SCAL          PDM_ADC_1_SCAL
#define PDM_ADC_1_SCAL_POS      (9U)
#define PDM_ADC_1_SCAL_LEN      (6U)
#define PDM_ADC_1_SCAL_MSK      (((1U << PDM_ADC_1_SCAL_LEN) - 1) << PDM_ADC_1_SCAL_POS)
#define PDM_ADC_1_SCAL_UMSK     (~(((1U << PDM_ADC_1_SCAL_LEN) - 1) << PDM_ADC_1_SCAL_POS))
#define PDM_ADC_2_SCAL          PDM_ADC_2_SCAL
#define PDM_ADC_2_SCAL_POS      (15U)
#define PDM_ADC_2_SCAL_LEN      (6U)
#define PDM_ADC_2_SCAL_MSK      (((1U << PDM_ADC_2_SCAL_LEN) - 1) << PDM_ADC_2_SCAL_POS)
#define PDM_ADC_2_SCAL_UMSK     (~(((1U << PDM_ADC_2_SCAL_LEN) - 1) << PDM_ADC_2_SCAL_POS))

/* 0xC0C : pdm_adc_1 */
#define PDM_ADC_1_OFFSET     (0xC0C)
#define PDM_ADC_0_K1         PDM_ADC_0_K1
#define PDM_ADC_0_K1_POS     (0U)
#define PDM_ADC_0_K1_LEN     (4U)
#define PDM_ADC_0_K1_MSK     (((1U << PDM_ADC_0_K1_LEN) - 1) << PDM_ADC_0_K1_POS)
#define PDM_ADC_0_K1_UMSK    (~(((1U << PDM_ADC_0_K1_LEN) - 1) << PDM_ADC_0_K1_POS))
#define PDM_ADC_0_K1_EN      PDM_ADC_0_K1_EN
#define PDM_ADC_0_K1_EN_POS  (4U)
#define PDM_ADC_0_K1_EN_LEN  (1U)
#define PDM_ADC_0_K1_EN_MSK  (((1U << PDM_ADC_0_K1_EN_LEN) - 1) << PDM_ADC_0_K1_EN_POS)
#define PDM_ADC_0_K1_EN_UMSK (~(((1U << PDM_ADC_0_K1_EN_LEN) - 1) << PDM_ADC_0_K1_EN_POS))
#define PDM_ADC_0_K2         PDM_ADC_0_K2
#define PDM_ADC_0_K2_POS     (5U)
#define PDM_ADC_0_K2_LEN     (4U)
#define PDM_ADC_0_K2_MSK     (((1U << PDM_ADC_0_K2_LEN) - 1) << PDM_ADC_0_K2_POS)
#define PDM_ADC_0_K2_UMSK    (~(((1U << PDM_ADC_0_K2_LEN) - 1) << PDM_ADC_0_K2_POS))
#define PDM_ADC_0_K2_EN      PDM_ADC_0_K2_EN
#define PDM_ADC_0_K2_EN_POS  (9U)
#define PDM_ADC_0_K2_EN_LEN  (1U)
#define PDM_ADC_0_K2_EN_MSK  (((1U << PDM_ADC_0_K2_EN_LEN) - 1) << PDM_ADC_0_K2_EN_POS)
#define PDM_ADC_0_K2_EN_UMSK (~(((1U << PDM_ADC_0_K2_EN_LEN) - 1) << PDM_ADC_0_K2_EN_POS))
#define PDM_ADC_1_K1         PDM_ADC_1_K1
#define PDM_ADC_1_K1_POS     (10U)
#define PDM_ADC_1_K1_LEN     (4U)
#define PDM_ADC_1_K1_MSK     (((1U << PDM_ADC_1_K1_LEN) - 1) << PDM_ADC_1_K1_POS)
#define PDM_ADC_1_K1_UMSK    (~(((1U << PDM_ADC_1_K1_LEN) - 1) << PDM_ADC_1_K1_POS))
#define PDM_ADC_1_K1_EN      PDM_ADC_1_K1_EN
#define PDM_ADC_1_K1_EN_POS  (14U)
#define PDM_ADC_1_K1_EN_LEN  (1U)
#define PDM_ADC_1_K1_EN_MSK  (((1U << PDM_ADC_1_K1_EN_LEN) - 1) << PDM_ADC_1_K1_EN_POS)
#define PDM_ADC_1_K1_EN_UMSK (~(((1U << PDM_ADC_1_K1_EN_LEN) - 1) << PDM_ADC_1_K1_EN_POS))
#define PDM_ADC_1_K2         PDM_ADC_1_K2
#define PDM_ADC_1_K2_POS     (15U)
#define PDM_ADC_1_K2_LEN     (4U)
#define PDM_ADC_1_K2_MSK     (((1U << PDM_ADC_1_K2_LEN) - 1) << PDM_ADC_1_K2_POS)
#define PDM_ADC_1_K2_UMSK    (~(((1U << PDM_ADC_1_K2_LEN) - 1) << PDM_ADC_1_K2_POS))
#define PDM_ADC_1_K2_EN      PDM_ADC_1_K2_EN
#define PDM_ADC_1_K2_EN_POS  (19U)
#define PDM_ADC_1_K2_EN_LEN  (1U)
#define PDM_ADC_1_K2_EN_MSK  (((1U << PDM_ADC_1_K2_EN_LEN) - 1) << PDM_ADC_1_K2_EN_POS)
#define PDM_ADC_1_K2_EN_UMSK (~(((1U << PDM_ADC_1_K2_EN_LEN) - 1) << PDM_ADC_1_K2_EN_POS))
#define PDM_ADC_2_K1         PDM_ADC_2_K1
#define PDM_ADC_2_K1_POS     (20U)
#define PDM_ADC_2_K1_LEN     (4U)
#define PDM_ADC_2_K1_MSK     (((1U << PDM_ADC_2_K1_LEN) - 1) << PDM_ADC_2_K1_POS)
#define PDM_ADC_2_K1_UMSK    (~(((1U << PDM_ADC_2_K1_LEN) - 1) << PDM_ADC_2_K1_POS))
#define PDM_ADC_2_K1_EN      PDM_ADC_2_K1_EN
#define PDM_ADC_2_K1_EN_POS  (24U)
#define PDM_ADC_2_K1_EN_LEN  (1U)
#define PDM_ADC_2_K1_EN_MSK  (((1U << PDM_ADC_2_K1_EN_LEN) - 1) << PDM_ADC_2_K1_EN_POS)
#define PDM_ADC_2_K1_EN_UMSK (~(((1U << PDM_ADC_2_K1_EN_LEN) - 1) << PDM_ADC_2_K1_EN_POS))
#define PDM_ADC_2_K2         PDM_ADC_2_K2
#define PDM_ADC_2_K2_POS     (25U)
#define PDM_ADC_2_K2_LEN     (4U)
#define PDM_ADC_2_K2_MSK     (((1U << PDM_ADC_2_K2_LEN) - 1) << PDM_ADC_2_K2_POS)
#define PDM_ADC_2_K2_UMSK    (~(((1U << PDM_ADC_2_K2_LEN) - 1) << PDM_ADC_2_K2_POS))
#define PDM_ADC_2_K2_EN      PDM_ADC_2_K2_EN
#define PDM_ADC_2_K2_EN_POS  (29U)
#define PDM_ADC_2_K2_EN_LEN  (1U)
#define PDM_ADC_2_K2_EN_MSK  (((1U << PDM_ADC_2_K2_EN_LEN) - 1) << PDM_ADC_2_K2_EN_POS)
#define PDM_ADC_2_K2_EN_UMSK (~(((1U << PDM_ADC_2_K2_EN_LEN) - 1) << PDM_ADC_2_K2_EN_POS))

