RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/pdm_reg.h
/* 0xC10 : pdm_dac_0 */
#define PDM_DAC_0_OFFSET            (0xC10)
#define PDM_ADC_PDM_H               PDM_ADC_PDM_H
#define PDM_ADC_PDM_H_POS           (0U)
#define PDM_ADC_PDM_H_LEN           (6U)
#define PDM_ADC_PDM_H_MSK           (((1U << PDM_ADC_PDM_H_LEN) - 1) << PDM_ADC_PDM_H_POS)
#define PDM_ADC_PDM_H_UMSK          (~(((1U << PDM_ADC_PDM_H_LEN) - 1) << PDM_ADC_PDM_H_POS))
#define PDM_ADC_PDM_L               PDM_ADC_PDM_L
#define PDM_ADC_PDM_L_POS           (6U)
#define PDM_ADC_PDM_L_LEN           (6U)
#define PDM_ADC_PDM_L_MSK           (((1U << PDM_ADC_PDM_L_LEN) - 1) << PDM_ADC_PDM_L_POS)
#define PDM_ADC_PDM_L_UMSK          (~(((1U << PDM_ADC_PDM_L_LEN) - 1) << PDM_ADC_PDM_L_POS))
#define PDM_ADC_0_PDM_LVL_SWAP      PDM_ADC_0_PDM_LVL_SWAP
#define PDM_ADC_0_PDM_LVL_SWAP_POS  (13U)
#define PDM_ADC_0_PDM_LVL_SWAP_LEN  (1U)
#define PDM_ADC_0_PDM_LVL_SWAP_MSK  (((1U << PDM_ADC_0_PDM_LVL_SWAP_LEN) - 1) << PDM_ADC_0_PDM_LVL_SWAP_POS)
#define PDM_ADC_0_PDM_LVL_SWAP_UMSK (~(((1U << PDM_ADC_0_PDM_LVL_SWAP_LEN) - 1) << PDM_ADC_0_PDM_LVL_SWAP_POS))
#define PDM_ADC_1_PDM_LVL_SWAP      PDM_ADC_1_PDM_LVL_SWAP
#define PDM_ADC_1_PDM_LVL_SWAP_POS  (16U)
#define PDM_ADC_1_PDM_LVL_SWAP_LEN  (1U)
#define PDM_ADC_1_PDM_LVL_SWAP_MSK  (((1U << PDM_ADC_1_PDM_LVL_SWAP_LEN) - 1) << PDM_ADC_1_PDM_LVL_SWAP_POS)
#define PDM_ADC_1_PDM_LVL_SWAP_UMSK (~(((1U << PDM_ADC_1_PDM_LVL_SWAP_LEN) - 1) << PDM_ADC_1_PDM_LVL_SWAP_POS))
#define PDM_ADC_2_PDM_LVL_SWAP      PDM_ADC_2_PDM_LVL_SWAP
#define PDM_ADC_2_PDM_LVL_SWAP_POS  (19U)
#define PDM_ADC_2_PDM_LVL_SWAP_LEN  (1U)
#define PDM_ADC_2_PDM_LVL_SWAP_MSK  (((1U << PDM_ADC_2_PDM_LVL_SWAP_LEN) - 1) << PDM_ADC_2_PDM_LVL_SWAP_POS)
#define PDM_ADC_2_PDM_LVL_SWAP_UMSK (~(((1U << PDM_ADC_2_PDM_LVL_SWAP_LEN) - 1) << PDM_ADC_2_PDM_LVL_SWAP_POS))

/* 0xC1C : pdm_pdm_0 */
#define PDM_PDM_0_OFFSET       (0xC1C)
#define PDM_0_EN               PDM_0_EN
#define PDM_0_EN_POS           (0U)
#define PDM_0_EN_LEN           (1U)
#define PDM_0_EN_MSK           (((1U << PDM_0_EN_LEN) - 1) << PDM_0_EN_POS)
#define PDM_0_EN_UMSK          (~(((1U << PDM_0_EN_LEN) - 1) << PDM_0_EN_POS))
#define PDM_1_EN               PDM_1_EN
#define PDM_1_EN_POS           (1U)
#define PDM_1_EN_LEN           (1U)
#define PDM_1_EN_MSK           (((1U << PDM_1_EN_LEN) - 1) << PDM_1_EN_POS)
#define PDM_1_EN_UMSK          (~(((1U << PDM_1_EN_LEN) - 1) << PDM_1_EN_POS))
#define PDM_2_EN               PDM_2_EN
#define PDM_2_EN_POS           (2U)
#define PDM_2_EN_LEN           (1U)
#define PDM_2_EN_MSK           (((1U << PDM_2_EN_LEN) - 1) << PDM_2_EN_POS)
#define PDM_2_EN_UMSK          (~(((1U << PDM_2_EN_LEN) - 1) << PDM_2_EN_POS))
#define PDM_ADC_0_PDM_SEL      PDM_ADC_0_PDM_SEL
#define PDM_ADC_0_PDM_SEL_POS  (3U)
#define PDM_ADC_0_PDM_SEL_LEN  (3U)
#define PDM_ADC_0_PDM_SEL_MSK  (((1U << PDM_ADC_0_PDM_SEL_LEN) - 1) << PDM_ADC_0_PDM_SEL_POS)
#define PDM_ADC_0_PDM_SEL_UMSK (~(((1U << PDM_ADC_0_PDM_SEL_LEN) - 1) << PDM_ADC_0_PDM_SEL_POS))
#define PDM_ADC_1_PDM_SEL      PDM_ADC_1_PDM_SEL
#define PDM_ADC_1_PDM_SEL_POS  (6U)
#define PDM_ADC_1_PDM_SEL_LEN  (3U)
#define PDM_ADC_1_PDM_SEL_MSK  (((1U << PDM_ADC_1_PDM_SEL_LEN) - 1) << PDM_ADC_1_PDM_SEL_POS)
#define PDM_ADC_1_PDM_SEL_UMSK (~(((1U << PDM_ADC_1_PDM_SEL_LEN) - 1) << PDM_ADC_1_PDM_SEL_POS))
#define PDM_ADC_2_PDM_SEL      PDM_ADC_2_PDM_SEL
#define PDM_ADC_2_PDM_SEL_POS  (9U)
#define PDM_ADC_2_PDM_SEL_LEN  (3U)
#define PDM_ADC_2_PDM_SEL_MSK  (((1U << PDM_ADC_2_PDM_SEL_LEN) - 1) << PDM_ADC_2_PDM_SEL_POS)
#define PDM_ADC_2_PDM_SEL_UMSK (~(((1U << PDM_ADC_2_PDM_SEL_LEN) - 1) << PDM_ADC_2_PDM_SEL_POS))

/* 0xC20 : pdm_rsvd0 */
#define PDM_RSVD0_OFFSET (0xC20)

/* 0xC24 : pdm_dbg_0 */
#define PDM_DBG_0_OFFSET           (0xC24)
#define PDM_ADC_TEST_CLKIN_EN      PDM_ADC_TEST_CLKIN_EN
#define PDM_ADC_TEST_CLKIN_EN_POS  (21U)
#define PDM_ADC_TEST_CLKIN_EN_LEN  (1U)
#define PDM_ADC_TEST_CLKIN_EN_MSK  (((1U << PDM_ADC_TEST_CLKIN_EN_LEN) - 1) << PDM_ADC_TEST_CLKIN_EN_POS)
#define PDM_ADC_TEST_CLKIN_EN_UMSK (~(((1U << PDM_ADC_TEST_CLKIN_EN_LEN) - 1) << PDM_ADC_TEST_CLKIN_EN_POS))
#define PDM_ADC_TEST_DIN_EN        PDM_ADC_TEST_DIN_EN
#define PDM_ADC_TEST_DIN_EN_POS    (23U)
#define PDM_ADC_TEST_DIN_EN_LEN    (1U)
#define PDM_ADC_TEST_DIN_EN_MSK    (((1U << PDM_ADC_TEST_DIN_EN_LEN) - 1) << PDM_ADC_TEST_DIN_EN_POS)
#define PDM_ADC_TEST_DIN_EN_UMSK   (~(((1U << PDM_ADC_TEST_DIN_EN_LEN) - 1) << PDM_ADC_TEST_DIN_EN_POS))
#define PDM_AUD_TEST_READ_SEL      PDM_AUD_TEST_READ_SEL
#define PDM_AUD_TEST_READ_SEL_POS  (24U)
#define PDM_AUD_TEST_READ_SEL_LEN  (6U)
#define PDM_AUD_TEST_READ_SEL_MSK  (((1U << PDM_AUD_TEST_READ_SEL_LEN) - 1) << PDM_AUD_TEST_READ_SEL_POS)
#define PDM_AUD_TEST_READ_SEL_UMSK (~(((1U << PDM_AUD_TEST_READ_SEL_LEN) - 1) << PDM_AUD_TEST_READ_SEL_POS))

/* 0xC28 : pdm_dbg_1 */
#define PDM_DBG_1_OFFSET       (0xC28)
#define PDM_AUD_TEST_READ      PDM_AUD_TEST_READ
#define PDM_AUD_TEST_READ_POS  (0U)
#define PDM_AUD_TEST_READ_LEN  (32U)
#define PDM_AUD_TEST_READ_MSK  (((1U << PDM_AUD_TEST_READ_LEN) - 1) << PDM_AUD_TEST_READ_POS)
#define PDM_AUD_TEST_READ_UMSK (~(((1U << PDM_AUD_TEST_READ_LEN) - 1) << PDM_AUD_TEST_READ_POS))

/* 0xC2C : pdm_dbg_2 */
#define PDM_DBG_2_OFFSET           (0xC2C)
#define PDM_ADC_FIR_4S_VAL         PDM_ADC_FIR_4S_VAL
#define PDM_ADC_FIR_4S_VAL_POS     (0U)
#define PDM_ADC_FIR_4S_VAL_LEN     (20U)
#define PDM_ADC_FIR_4S_VAL_MSK     (((1U << PDM_ADC_FIR_4S_VAL_LEN) - 1) << PDM_ADC_FIR_4S_VAL_POS)
#define PDM_ADC_FIR_4S_VAL_UMSK    (~(((1U << PDM_ADC_FIR_4S_VAL_LEN) - 1) << PDM_ADC_FIR_4S_VAL_POS))
#define PDM_ADC_0_FIR_4S_EN        PDM_ADC_0_FIR_4S_EN
#define PDM_ADC_0_FIR_4S_EN_POS    (20U)
#define PDM_ADC_0_FIR_4S_EN_LEN    (1U)
#define PDM_ADC_0_FIR_4S_EN_MSK    (((1U << PDM_ADC_0_FIR_4S_EN_LEN) - 1) << PDM_ADC_0_FIR_4S_EN_POS)
#define PDM_ADC_0_FIR_4S_EN_UMSK   (~(((1U << PDM_ADC_0_FIR_4S_EN_LEN) - 1) << PDM_ADC_0_FIR_4S_EN_POS))
#define PDM_ADC_1_FIR_4S_EN        PDM_ADC_1_FIR_4S_EN
#define PDM_ADC_1_FIR_4S_EN_POS    (21U)
#define PDM_ADC_1_FIR_4S_EN_LEN    (1U)
#define PDM_ADC_1_FIR_4S_EN_MSK    (((1U << PDM_ADC_1_FIR_4S_EN_LEN) - 1) << PDM_ADC_1_FIR_4S_EN_POS)
#define PDM_ADC_1_FIR_4S_EN_UMSK   (~(((1U << PDM_ADC_1_FIR_4S_EN_LEN) - 1) << PDM_ADC_1_FIR_4S_EN_POS))
#define PDM_ADC_2_FIR_4S_EN        PDM_ADC_2_FIR_4S_EN
#define PDM_ADC_2_FIR_4S_EN_POS    (22U)
#define PDM_ADC_2_FIR_4S_EN_LEN    (1U)
#define PDM_ADC_2_FIR_4S_EN_MSK    (((1U << PDM_ADC_2_FIR_4S_EN_LEN) - 1) << PDM_ADC_2_FIR_4S_EN_POS)
#define PDM_ADC_2_FIR_4S_EN_UMSK   (~(((1U << PDM_ADC_2_FIR_4S_EN_LEN) - 1) << PDM_ADC_2_FIR_4S_EN_POS))
#define PDM_ADC_IN_0_TEST_SEL      PDM_ADC_IN_0_TEST_SEL
#define PDM_ADC_IN_0_TEST_SEL_POS  (23U)
#define PDM_ADC_IN_0_TEST_SEL_LEN  (1U)
#define PDM_ADC_IN_0_TEST_SEL_MSK  (((1U << PDM_ADC_IN_0_TEST_SEL_LEN) - 1) << PDM_ADC_IN_0_TEST_SEL_POS)
#define PDM_ADC_IN_0_TEST_SEL_UMSK (~(((1U << PDM_ADC_IN_0_TEST_SEL_LEN) - 1) << PDM_ADC_IN_0_TEST_SEL_POS))
#define PDM_ADC_IN_1_TEST_SEL      PDM_ADC_IN_1_TEST_SEL
#define PDM_ADC_IN_1_TEST_SEL_POS  (24U)
#define PDM_ADC_IN_1_TEST_SEL_LEN  (1U)
#define PDM_ADC_IN_1_TEST_SEL_MSK  (((1U << PDM_ADC_IN_1_TEST_SEL_LEN) - 1) << PDM_ADC_IN_1_TEST_SEL_POS)
#define PDM_ADC_IN_1_TEST_SEL_UMSK (~(((1U << PDM_ADC_IN_1_TEST_SEL_LEN) - 1) << PDM_ADC_IN_1_TEST_SEL_POS))
#define PDM_ADC_IN_2_TEST_SEL      PDM_ADC_IN_2_TEST_SEL
#define PDM_ADC_IN_2_TEST_SEL_POS  (25U)
#define PDM_ADC_IN_2_TEST_SEL_LEN  (1U)
#define PDM_ADC_IN_2_TEST_SEL_MSK  (((1U << PDM_ADC_IN_2_TEST_SEL_LEN) - 1) << PDM_ADC_IN_2_TEST_SEL_POS)
#define PDM_ADC_IN_2_TEST_SEL_UMSK (~(((1U << PDM_ADC_IN_2_TEST_SEL_LEN) - 1) << PDM_ADC_IN_2_TEST_SEL_POS))

/* 0xC30 : pdm_dbg_3 */
#define PDM_DBG_3_OFFSET (0xC30)

