RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/pdm_reg.h
/* 0xC34 : pdm_dbg_4 */
#define PDM_DBG_4_OFFSET                 (0xC34)
#define PDM_ADC_IN_RATIO_4S_VAL          PDM_ADC_IN_RATIO_4S_VAL
#define PDM_ADC_IN_RATIO_4S_VAL_POS      (0U)
#define PDM_ADC_IN_RATIO_4S_VAL_LEN      (1U)
#define PDM_ADC_IN_RATIO_4S_VAL_MSK      (((1U << PDM_ADC_IN_RATIO_4S_VAL_LEN) - 1) << PDM_ADC_IN_RATIO_4S_VAL_POS)
#define PDM_ADC_IN_RATIO_4S_VAL_UMSK     (~(((1U << PDM_ADC_IN_RATIO_4S_VAL_LEN) - 1) << PDM_ADC_IN_RATIO_4S_VAL_POS))
#define PDM_ADC_IN_CH0_RATIO_4S_VAL      PDM_ADC_IN_CH0_RATIO_4S_VAL
#define PDM_ADC_IN_CH0_RATIO_4S_VAL_POS  (1U)
#define PDM_ADC_IN_CH0_RATIO_4S_VAL_LEN  (1U)
#define PDM_ADC_IN_CH0_RATIO_4S_VAL_MSK  (((1U << PDM_ADC_IN_CH0_RATIO_4S_VAL_LEN) - 1) << PDM_ADC_IN_CH0_RATIO_4S_VAL_POS)
#define PDM_ADC_IN_CH0_RATIO_4S_VAL_UMSK (~(((1U << PDM_ADC_IN_CH0_RATIO_4S_VAL_LEN) - 1) << PDM_ADC_IN_CH0_RATIO_4S_VAL_POS))
#define PDM_ADC_IN_CH1_RATIO_4S_VAL      PDM_ADC_IN_CH1_RATIO_4S_VAL
#define PDM_ADC_IN_CH1_RATIO_4S_VAL_POS  (2U)
#define PDM_ADC_IN_CH1_RATIO_4S_VAL_LEN  (1U)
#define PDM_ADC_IN_CH1_RATIO_4S_VAL_MSK  (((1U << PDM_ADC_IN_CH1_RATIO_4S_VAL_LEN) - 1) << PDM_ADC_IN_CH1_RATIO_4S_VAL_POS)
#define PDM_ADC_IN_CH1_RATIO_4S_VAL_UMSK (~(((1U << PDM_ADC_IN_CH1_RATIO_4S_VAL_LEN) - 1) << PDM_ADC_IN_CH1_RATIO_4S_VAL_POS))
#define PDM_ADC_IN_CH2_RATIO_4S_VAL      PDM_ADC_IN_CH2_RATIO_4S_VAL
#define PDM_ADC_IN_CH2_RATIO_4S_VAL_POS  (3U)
#define PDM_ADC_IN_CH2_RATIO_4S_VAL_LEN  (1U)
#define PDM_ADC_IN_CH2_RATIO_4S_VAL_MSK  (((1U << PDM_ADC_IN_CH2_RATIO_4S_VAL_LEN) - 1) << PDM_ADC_IN_CH2_RATIO_4S_VAL_POS)
#define PDM_ADC_IN_CH2_RATIO_4S_VAL_UMSK (~(((1U << PDM_ADC_IN_CH2_RATIO_4S_VAL_LEN) - 1) << PDM_ADC_IN_CH2_RATIO_4S_VAL_POS))
#define PDM_IN_RATIO_4S_VAL              PDM_IN_RATIO_4S_VAL
#define PDM_IN_RATIO_4S_VAL_POS          (4U)
#define PDM_IN_RATIO_4S_VAL_LEN          (1U)
#define PDM_IN_RATIO_4S_VAL_MSK          (((1U << PDM_IN_RATIO_4S_VAL_LEN) - 1) << PDM_IN_RATIO_4S_VAL_POS)
#define PDM_IN_RATIO_4S_VAL_UMSK         (~(((1U << PDM_IN_RATIO_4S_VAL_LEN) - 1) << PDM_IN_RATIO_4S_VAL_POS))
#define PDM_IN_RATIO_4S                  PDM_IN_RATIO_4S
#define PDM_IN_RATIO_4S_POS              (5U)
#define PDM_IN_RATIO_4S_LEN              (1U)
#define PDM_IN_RATIO_4S_MSK              (((1U << PDM_IN_RATIO_4S_LEN) - 1) << PDM_IN_RATIO_4S_POS)
#define PDM_IN_RATIO_4S_UMSK             (~(((1U << PDM_IN_RATIO_4S_LEN) - 1) << PDM_IN_RATIO_4S_POS))

/* 0xC38 : pdm_adc_s0 */
#define PDM_ADC_S0_OFFSET      (0xC38)
#define PDM_ADC_S0_VOLUME      PDM_ADC_S0_VOLUME
#define PDM_ADC_S0_VOLUME_POS  (0U)
#define PDM_ADC_S0_VOLUME_LEN  (9U)
#define PDM_ADC_S0_VOLUME_MSK  (((1U << PDM_ADC_S0_VOLUME_LEN) - 1) << PDM_ADC_S0_VOLUME_POS)
#define PDM_ADC_S0_VOLUME_UMSK (~(((1U << PDM_ADC_S0_VOLUME_LEN) - 1) << PDM_ADC_S0_VOLUME_POS))

/* 0xC3C : pdm_adc_s1 */
#define PDM_ADC_S1_OFFSET      (0xC3C)
#define PDM_ADC_S1_VOLUME      PDM_ADC_S1_VOLUME
#define PDM_ADC_S1_VOLUME_POS  (0U)
#define PDM_ADC_S1_VOLUME_LEN  (9U)
#define PDM_ADC_S1_VOLUME_MSK  (((1U << PDM_ADC_S1_VOLUME_LEN) - 1) << PDM_ADC_S1_VOLUME_POS)
#define PDM_ADC_S1_VOLUME_UMSK (~(((1U << PDM_ADC_S1_VOLUME_LEN) - 1) << PDM_ADC_S1_VOLUME_POS))

/* 0xC40 : pdm_adc_s2 */
#define PDM_ADC_S2_OFFSET      (0xC40)
#define PDM_ADC_S2_VOLUME      PDM_ADC_S2_VOLUME
#define PDM_ADC_S2_VOLUME_POS  (0U)
#define PDM_ADC_S2_VOLUME_LEN  (9U)
#define PDM_ADC_S2_VOLUME_MSK  (((1U << PDM_ADC_S2_VOLUME_LEN) - 1) << PDM_ADC_S2_VOLUME_POS)
#define PDM_ADC_S2_VOLUME_UMSK (~(((1U << PDM_ADC_S2_VOLUME_LEN) - 1) << PDM_ADC_S2_VOLUME_POS))

/* 0xC80 : pdm_rx_fifo_ctrl */
#define PDM_RX_FIFO_CTRL_OFFSET (0xC80)
#define PDM_RX_FIFO_FLUSH       PDM_RX_FIFO_FLUSH
#define PDM_RX_FIFO_FLUSH_POS   (0U)
#define PDM_RX_FIFO_FLUSH_LEN   (1U)
#define PDM_RX_FIFO_FLUSH_MSK   (((1U << PDM_RX_FIFO_FLUSH_LEN) - 1) << PDM_RX_FIFO_FLUSH_POS)
#define PDM_RX_FIFO_FLUSH_UMSK  (~(((1U << PDM_RX_FIFO_FLUSH_LEN) - 1) << PDM_RX_FIFO_FLUSH_POS))
#define PDM_RXO_INT_EN          PDM_RXO_INT_EN
#define PDM_RXO_INT_EN_POS      (1U)
#define PDM_RXO_INT_EN_LEN      (1U)
#define PDM_RXO_INT_EN_MSK      (((1U << PDM_RXO_INT_EN_LEN) - 1) << PDM_RXO_INT_EN_POS)
#define PDM_RXO_INT_EN_UMSK     (~(((1U << PDM_RXO_INT_EN_LEN) - 1) << PDM_RXO_INT_EN_POS))
#define PDM_RXU_INT_EN          PDM_RXU_INT_EN
#define PDM_RXU_INT_EN_POS      (2U)
#define PDM_RXU_INT_EN_LEN      (1U)
#define PDM_RXU_INT_EN_MSK      (((1U << PDM_RXU_INT_EN_LEN) - 1) << PDM_RXU_INT_EN_POS)
#define PDM_RXU_INT_EN_UMSK     (~(((1U << PDM_RXU_INT_EN_LEN) - 1) << PDM_RXU_INT_EN_POS))
#define PDM_RXA_INT_EN          PDM_RXA_INT_EN
#define PDM_RXA_INT_EN_POS      (3U)
#define PDM_RXA_INT_EN_LEN      (1U)
#define PDM_RXA_INT_EN_MSK      (((1U << PDM_RXA_INT_EN_LEN) - 1) << PDM_RXA_INT_EN_POS)
#define PDM_RXA_INT_EN_UMSK     (~(((1U << PDM_RXA_INT_EN_LEN) - 1) << PDM_RXA_INT_EN_POS))
#define PDM_RX_DRQ_EN           PDM_RX_DRQ_EN
#define PDM_RX_DRQ_EN_POS       (4U)
#define PDM_RX_DRQ_EN_LEN       (1U)
#define PDM_RX_DRQ_EN_MSK       (((1U << PDM_RX_DRQ_EN_LEN) - 1) << PDM_RX_DRQ_EN_POS)
#define PDM_RX_DRQ_EN_UMSK      (~(((1U << PDM_RX_DRQ_EN_LEN) - 1) << PDM_RX_DRQ_EN_POS))
#define PDM_RX_DATA_RES         PDM_RX_DATA_RES
#define PDM_RX_DATA_RES_POS     (5U)
#define PDM_RX_DATA_RES_LEN     (1U)
#define PDM_RX_DATA_RES_MSK     (((1U << PDM_RX_DATA_RES_LEN) - 1) << PDM_RX_DATA_RES_POS)
#define PDM_RX_DATA_RES_UMSK    (~(((1U << PDM_RX_DATA_RES_LEN) - 1) << PDM_RX_DATA_RES_POS))
#define PDM_RX_CH_EN            PDM_RX_CH_EN
#define PDM_RX_CH_EN_POS        (8U)
#define PDM_RX_CH_EN_LEN        (3U)
#define PDM_RX_CH_EN_MSK        (((1U << PDM_RX_CH_EN_LEN) - 1) << PDM_RX_CH_EN_POS)
#define PDM_RX_CH_EN_UMSK       (~(((1U << PDM_RX_CH_EN_LEN) - 1) << PDM_RX_CH_EN_POS))
#define PDM_RX_DRQ_CNT          PDM_RX_DRQ_CNT
#define PDM_RX_DRQ_CNT_POS      (14U)
#define PDM_RX_DRQ_CNT_LEN      (2U)
#define PDM_RX_DRQ_CNT_MSK      (((1U << PDM_RX_DRQ_CNT_LEN) - 1) << PDM_RX_DRQ_CNT_POS)
#define PDM_RX_DRQ_CNT_UMSK     (~(((1U << PDM_RX_DRQ_CNT_LEN) - 1) << PDM_RX_DRQ_CNT_POS))
#define PDM_RX_TRG_LEVEL        PDM_RX_TRG_LEVEL
#define PDM_RX_TRG_LEVEL_POS    (16U)
#define PDM_RX_TRG_LEVEL_LEN    (6U)
#define PDM_RX_TRG_LEVEL_MSK    (((1U << PDM_RX_TRG_LEVEL_LEN) - 1) << PDM_RX_TRG_LEVEL_POS)
#define PDM_RX_TRG_LEVEL_UMSK   (~(((1U << PDM_RX_TRG_LEVEL_LEN) - 1) << PDM_RX_TRG_LEVEL_POS))
#define PDM_RX_DATA_MODE        PDM_RX_DATA_MODE
#define PDM_RX_DATA_MODE_POS    (24U)
#define PDM_RX_DATA_MODE_LEN    (2U)
#define PDM_RX_DATA_MODE_MSK    (((1U << PDM_RX_DATA_MODE_LEN) - 1) << PDM_RX_DATA_MODE_POS)
#define PDM_RX_DATA_MODE_UMSK   (~(((1U << PDM_RX_DATA_MODE_LEN) - 1) << PDM_RX_DATA_MODE_POS))

/* 0xC84 : pdm_rx_fifo_status */
#define PDM_RX_FIFO_STATUS_OFFSET (0xC84)
#define PDM_RXO_INT               PDM_RXO_INT
#define PDM_RXO_INT_POS           (1U)
#define PDM_RXO_INT_LEN           (1U)
#define PDM_RXO_INT_MSK           (((1U << PDM_RXO_INT_LEN) - 1) << PDM_RXO_INT_POS)
#define PDM_RXO_INT_UMSK          (~(((1U << PDM_RXO_INT_LEN) - 1) << PDM_RXO_INT_POS))
#define PDM_RXU_INT               PDM_RXU_INT
#define PDM_RXU_INT_POS           (2U)
#define PDM_RXU_INT_LEN           (1U)
#define PDM_RXU_INT_MSK           (((1U << PDM_RXU_INT_LEN) - 1) << PDM_RXU_INT_POS)
#define PDM_RXU_INT_UMSK          (~(((1U << PDM_RXU_INT_LEN) - 1) << PDM_RXU_INT_POS))
#define PDM_RXA_INT               PDM_RXA_INT
#define PDM_RXA_INT_POS           (4U)
#define PDM_RXA_INT_LEN           (1U)
#define PDM_RXA_INT_MSK           (((1U << PDM_RXA_INT_LEN) - 1) << PDM_RXA_INT_POS)
#define PDM_RXA_INT_UMSK          (~(((1U << PDM_RXA_INT_LEN) - 1) << PDM_RXA_INT_POS))
#define PDM_RXA_CNT               PDM_RXA_CNT
#define PDM_RXA_CNT_POS           (16U)
#define PDM_RXA_CNT_LEN           (6U)
#define PDM_RXA_CNT_MSK           (((1U << PDM_RXA_CNT_LEN) - 1) << PDM_RXA_CNT_POS)
#define PDM_RXA_CNT_UMSK          (~(((1U << PDM_RXA_CNT_LEN) - 1) << PDM_RXA_CNT_POS))
#define PDM_RXA                   PDM_RXA
#define PDM_RXA_POS               (24U)
#define PDM_RXA_LEN               (1U)
#define PDM_RXA_MSK               (((1U << PDM_RXA_LEN) - 1) << PDM_RXA_POS)
#define PDM_RXA_UMSK              (~(((1U << PDM_RXA_LEN) - 1) << PDM_RXA_POS))

/* 0xC88 : pdm_rx_fifo_data */
#define PDM_RX_FIFO_DATA_OFFSET (0xC88)
#define PDM_RX_DATA             PDM_RX_DATA
#define PDM_RX_DATA_POS         (0U)
#define PDM_RX_DATA_LEN         (32U)
#define PDM_RX_DATA_MSK         (((1U << PDM_RX_DATA_LEN) - 1) << PDM_RX_DATA_POS)
#define PDM_RX_DATA_UMSK        (~(((1U << PDM_RX_DATA_LEN) - 1) << PDM_RX_DATA_POS))

struct pdm_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[3072];

    /* 0xC00 : audpdm_top */
    union {
        struct {
            uint32_t audio_ckg_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1      : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t adc_itf_inv_sel : 1;  /* [    2],        r/w,        0x0 */
            uint32_t pdm_itf_inv_sel : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_27   : 24; /* [27: 4],       rsvd,        0x0 */
            uint32_t adc_rate        : 3;  /* [30:28],        r/w,        0x1 */
            uint32_t reserved_31     : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audpdm_top;

